Белгипрозем_2017/src/Catalogs/Инструкции/Инструкции.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Инструкции</name>
  <attributes>
    <name>Активна</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяМакетаТиповой</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредметИнструкции</name>
    <type>
      <types>CatalogRef.ПредметыИнструкций</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстИнструкции</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьВидДокумента</name>
    <type>
      <types>CatalogRef.ВидыВнутреннихДокументов</types>
      <types>CatalogRef.ВидыВходящихДокументов</types>
      <types>CatalogRef.ВидыИсходящихДокументов</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьВопросДеятельности</name>
    <type>
      <types>CatalogRef.ВопросыДеятельности</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьГрифДоступа</name>
    <type>
      <types>CatalogRef.ГрифыДоступа</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьСостояниеДокумента</name>
    <type>
      <types>EnumRef.СостоянияДокументов</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДоступНаЧтение</name>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.РолиИсполнителей</types>
        <types>CatalogRef.ГруппыПользователей</types>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ОсновнойОбъектАдресации</name>
      <type>
        <types>Characteristic.ОбъектыАдресацииЗадач</types>
      </type>
    </attributes>
    <attributes>
      <name>ДополнительныйОбъектАдресации</name>
      <type>
        <types>Characteristic.ОбъектыАдресацииЗадач</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>УсловияОтображения</name>
    <attributes>
      <name>ВидДокумента</name>
      <type>
        <types>CatalogRef.ВидыВнутреннихДокументов</types>
        <types>CatalogRef.ВидыВходящихДокументов</types>
        <types>CatalogRef.ВидыИсходящихДокументов</types>
      </type>
    </attributes>
    <attributes>
      <name>СостояниеДокумента</name>
      <type>
        <types>EnumRef.СостоянияДокументов</types>
      </type>
    </attributes>
    <attributes>
      <name>ГрифДоступа</name>
      <type>
        <types>CatalogRef.ГрифыДоступа</types>
      </type>
    </attributes>
    <attributes>
      <name>ВопросДеятельности</name>
      <type>
        <types>CatalogRef.ВопросыДеятельности</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Белгипрозем_2017/src/Catalogs/ГруппыПользователей/ГруппыПользователей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ГруппыПользователей</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <predefined>
    <items>
      <name>ВсеПользователи</name>
      <description>Все пользователи</description>
    </items>
  </predefined>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Состав</name>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Белгипрозем_2017/src/Catalogs/Инструкции/ManagerModule.bsl
#Область ОбработчикиСобытий

Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
	
	ЕстьТолькоПравоЧтенияИнструкции = РаботаСИнструкциями.ПравоТолькоЧтения();
	
	Если Не ЕстьТолькоПравоЧтенияИнструкции Тогда
		Если ВидФормы = "ФормаОбъекта" Тогда
			ВыбраннаяФорма = "ФормаЭлемента";
			СтандартнаяОбработка = Ложь;
		ИначеЕсли ВидФормы = "ФормаСписка" Тогда
			ВыбраннаяФорма = "ФормаДерева";
			СтандартнаяОбработка = Ложь;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область УправлениеДоступом

Функция ПолучитьПоляДоступа() Экспорт
	
	Возврат "Ссылка";
	
КонецФункции

Процедура ЗаполнитьДескрипторДоступа(ОбъектДоступа, ДескрипторДоступа) Экспорт
	
	ДоступНаЧтение = ОбъектДоступа.Ссылка.ДоступНаЧтение;
	Если ДоступНаЧтение.Количество() > 0 Тогда
		Для Каждого ТекущаяСтрока Из ДоступНаЧтение Цикл
			Строка = ДескрипторДоступа.Пользователи.Добавить();
			Строка.Пользователь = ТекущаяСтрока.Пользователь;
			Строка.ОсновнойОбъектАдресации = ТекущаяСтрока.ОсновнойОбъектАдресации;
			Строка.ДополнительныйОбъектАдресации = ТекущаяСтрока.ДополнительныйОбъектАдресации;
		КонецЦикла;	
	Иначе
		Строка = ДескрипторДоступа.Пользователи.Добавить();
		Строка.Пользователь = Справочники.ГруппыПользователей.ВсеПользователи;
	КонецЕсли;
	
КонецПроцедуры	

Функция ЕстьМетодЗаполнитьПраваДоступа() Экспорт
	
	Возврат Истина;
	
КонецФункции	

Процедура ЗаполнитьПраваДоступа(ДескрипторДоступа, ПраваДоступа, ПротоколРасчетаПрав) Экспорт

	Для Каждого Эл Из ДескрипторДоступа.Пользователи Цикл
		
		ПраваПользователя = Новый Структура("Чтение, Добавление, Изменение, Удаление, УправлениеПравами",
										Истина, Ложь, Ложь, Ложь, Ложь);
		
		ДокументооборотПраваДоступа.ДобавитьПользователяВСоответствиеПрав(
			ПраваДоступа,
			Эл.Пользователь,
			Эл.ОсновнойОбъектАдресации,
			Эл.ДополнительныйОбъектАдресации,
			ПраваПользователя);
		
	КонецЦикла;	
	
КонецПроцедуры	

#КонецОбласти

#КонецОбласти
